Revit 2027 API
FormatOptions.CanHaveSymbol Method
 Checks whether a symbol can be specified to display the unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveSymbol()
Public Function CanHaveSymbol As Boolean
public:
bool CanHaveSymbol()
member CanHaveSymbol : unit -> bool
Return Value
Boolean
 True if a symbol can be specified, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
CanHaveSymbol Overload
Autodesk.Revit.DB Namespace